Revit 2024 API
ComboBox.CurrentChanged Event
Subscribe to this event to be notified when the current item of the ComboBox is changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public event EventHandler<ComboBoxCurrentChangedEventArgs> CurrentChanged
Visual Basic
Public Event CurrentChanged As EventHandler(Of ComboBoxCurrentChangedEventArgs)
Visual C++
public:
 event EventHandler<ComboBoxCurrentChangedEventArgs^>^ CurrentChanged {
	void add (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
}
See Also
ComboBox Class
Autodesk.Revit.UI Namespace